{
  "posts": [
    {
      "id": "cnc-precision-2026",
      "title": "The Future of 5-Axis CNC Precision in Gujarat",
      "excerpt": "Exploring how multi-axis machining is revolutionizing wood carving and metal fabrication for architectural projects in Vadodara.",
      "category": "Machinery Updates",
      "date": "2026-01-15",
      "image": "https://images.unsplash.com/photo-1565193566173-7a0ee3dbe261?w=600&q=80",
      "tags": [
        "CNC",
        "Technology",
        "Precision"
      ],
      "url": "update-details.html?id=cnc-precision-2026",
      "content": [
        {
          "type": "paragraph",
          "text": "The architectural landscape in Gujarat is undergoing a significant transformation, driven by advancements in CNC technology. At Suhani Industries, we have witnessed firsthand how 5-axis machining is redefining what is possible in both wood carving and metal fabrication."
        },
        {
          "type": "image",
          "src": "https://images.unsplash.com/photo-1635326444826-06c8f8b2e914?w=800&q=80",
          "caption": "High-precision 5-axis CNC machine in action."
        },
        {
          "type": "heading",
          "text": "Beyond Traditional Boundaries"
        },
        {
          "type": "paragraph",
          "text": "Traditional 3-axis machines are limited to cutting from the top down. However, our new 5-axis capabilities allow the cutting tool to approach the workpiece from virtually any direction. This means we can create complex undercuts, deep cavities, and smooth curved surfaces that were previously impossible or required hours of manual labor."
        },
        {
          "type": "paragraph",
          "text": "For our clients in Vadodara and beyond, this translates to more intricate furniture designs, seamless architectural moldings, and precision engineering components that fit perfectly every time."
        }
      ]
    },
    {
      "id": "wave-board-trends",
      "title": "Top 5 Wave Board Textures Trending in 2026",
      "excerpt": "From organic river flows to geometric sharp ridges—see what interior designers are choosing for luxury wall cladding this year.",
      "category": "New Designs",
      "date": "2026-01-28",
      "image": "https://images.unsplash.com/photo-1504917595217-d4dc5ebe6122?w=600&q=80",
      "tags": [
        "Interiors",
        "Wave Board",
        "Design"
      ],
      "url": "update-details.html?id=wave-board-trends",
      "content": [
        {
          "type": "paragraph",
          "text": "Wall cladding has evolved from simple paneling to dynamic, 3D textured surfaces. Wave boards are leading this trend, offering a unique interplay of light and shadow that adds depth to any interior space."
        },
        {
          "type": "heading",
          "text": "1. Organic River Flow"
        },
        {
          "type": "paragraph",
          "text": "Inspired by nature, these soft, undulated patterns mimic the gentle flow of water. They are perfect for creating a calming atmosphere in residential living rooms and spa lobbies."
        },
        {
          "type": "image",
          "src": "https://images.unsplash.com/photo-1513694203232-719a280e022f?w=800&q=80",
          "caption": "Organic wave patterns creating a soothing ambiance."
        },
        {
          "type": "heading",
          "text": "2. Geometric Sharp Ridges"
        },
        {
          "type": "paragraph",
          "text": "For a more modern, industrial look, geometric wave boards with sharp, defined ridges are gaining popularity. These high-contrast designs make a bold statement in corporate offices and retail showrooms."
        }
      ]
    },
    {
      "id": "custom-temple-carving",
      "title": "Case Study: 8ft Intricate Wooden Temple",
      "excerpt": "A behind-the-scenes look at how we digitized a traditional sketch and carved it into solid teak wood with zero error.",
      "category": "Project Spotlight",
      "date": "2025-12-10",
      "image": "https://images.unsplash.com/photo-1621262973740-4547926b66d6?w=600&q=80",
      "tags": [
        "3D Carving",
        "Temple",
        "Wood"
      ],
      "url": "update-details.html?id=custom-temple-carving",
      "content": [
        {
          "type": "paragraph",
          "text": "Preserving tradition while utilizing modern technology is a delicate balance. Recently, we were commissioned to create an 8-foot intricate wooden temple for a private residence, based solely on a hand-drawn sketch by a traditional artisan."
        },
        {
          "type": "heading",
          "text": "The Digitization Process"
        },
        {
          "type": "paragraph",
          "text": "Our design team meticulously converted the 2D sketch into a high-fidelity 3D model using specialized CAD software. This step allowed us to verify every detail and proportion before a single wood chip was removed."
        },
        {
          "type": "image",
          "src": "https://images.unsplash.com/photo-1605218427368-35b8dd78d8e6?w=800&q=80",
          "caption": "Initial 2D sketch vs. the final 3D rendered model."
        },
        {
          "type": "paragraph",
          "text": "The carving was executed on our largest CNC router using solid teak wood. The result was a flawless masterpiece that honored the original artistic vision with the precision that only CNC machining can provide."
        }
      ]
    },
    {
      "id": "metal-jali-facades",
      "title": "Metal CNC Jali: Durability Meets Aesthetics",
      "excerpt": "Why architects are switching to CNC-cut metal screens for exterior facades. Weather resistance and pattern versatility explained.",
      "category": "Metal Work",
      "date": "2025-11-05",
      "image": "https://images.unsplash.com/photo-1535958636474-b021ee8876a3?w=600&q=80",
      "tags": [
        "Metal CNC",
        "Exterior",
        "Architecture"
      ],
      "url": "update-details.html?id=metal-jali-facades",
      "content": [
        {
          "type": "paragraph",
          "text": "Exterior facades serve two purposes: protection and aesthetics. Metal CNC Jali screens are rapidly becoming the preferred choice for architects looking to achieve both without compromise."
        },
        {
          "type": "heading",
          "text": "Weather Resistance"
        },
        {
          "type": "paragraph",
          "text": "Unlike wood or PVC, properly treated metal (such as powder-coated aluminum or stainless steel) can withstand harsh sunlight and heavy monsoon rains for decades without warping or fading."
        },
        {
          "type": "image",
          "src": "https://images.unsplash.com/photo-1486406146926-c627a92ad1ab?w=800&q=80",
          "caption": "Modern building facade featuring intricate metal jali work."
        }
      ]
    },
    {
      "id": "acrylic-parametirc",
      "title": "Working with Acrylic: The Parametric Approach",
      "excerpt": "How we achieve glass-like finishes on acrylic sheets using advanced CNC router bits and cooling systems.",
      "category": "New Designs",
      "date": "2025-10-20",
      "image": "https://images.unsplash.com/photo-1518640165980-d3e0e2aa6c1e?w=600&q=80",
      "tags": [
        "Acrylic",
        "Parametric",
        "Materials"
      ],
      "url": "update-details.html?id=acrylic-parametirc",
      "content": [
        {
          "type": "paragraph",
          "text": "Acrylic is a versatile material, but machining it to a crystal-clear finish requires expertise. At Suhani Industries, we utilize specialized single-flute bits and air-cooling systems to prevent heat buildup, ensuring a polished edge straight off the machine."
        },
        {
          "type": "heading",
          "text": "Parametric Design Applications"
        },
        {
          "type": "paragraph",
          "text": "We are increasingly seeing acrylic used in parametric installations—complex, flowing structures made of individual unique ribs. Our precise numbering and nesting algorithms make assembling these complex puzzles efficient and error-free."
        },
        {
          "type": "image",
          "src": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?w=800&q=80",
          "caption": "Complex parametric structure created with CNC machined acrylic components."
        }
      ]
    },
    {
      "id": "workshop-expansion",
      "title": "Suhani Industries Expands Workshop Capacity",
      "excerpt": "We have added two new industrial-grade routers to decrease turnaround time for bulk orders. Read about our facility upgrade.",
      "category": "Company News",
      "date": "2025-09-15",
      "image": "https://images.unsplash.com/photo-1581091226825-a6a2a5aee158?w=600&q=80",
      "tags": [
        "News",
        "Growth",
        "Factory"
      ],
      "url": "update-details.html?id=workshop-expansion",
      "content": [
        {
          "type": "paragraph",
          "text": "Growth is a sign of trust. Thanks to the continued support of our clients, Suhani Industries is proud to announce a significant expansion of our manufacturing facility."
        },
        {
          "type": "heading",
          "text": "New Capabilities"
        },
        {
          "type": "paragraph",
          "text": "We have installed two new heavy-duty CNC routers, increasing our daily output capacity by 40%. This investment allows us to handle larger bulk orders with shorter turnaround times, ensuring that your projects effectively stay on schedule."
        },
        {
          "type": "image",
          "src": "https://images.unsplash.com/photo-1504384308090-c54be3855091?w=800&q=80",
          "caption": "Our expanded workshop floor with new machinery installation."
        }
      ]
    }
  ]
}